# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'imagemagick --with-webp'
brew 'ffmpeg'
brew 'git'
brew 'git-extras'
brew 'grep'
brew 'hub'
brew 'mackup'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# brew 'cgal'
# brew 'gh'
# brew 'gnupg2'
# brew 'httpie'
# brew 'mas' # Mac App Store manager
# brew 'stripe'
# brew 'trash' # Manage the Trash bin
# brew 'cmatrix'
# brew 'htop-osx'
# brew 'id3tool'
# brew 'jq'
# brew 'lesspipe'
# brew 'ssh-copy-id'
# brew 'terminal-notifier'
# brew 'thefuck'
# brew 'ansible'
# brew 'man2html'
# brew 'reattach-to-user-namespace'
# brew 'sl'
# brew 'smartmontools'
# brew 'the_silver_searcher'
# brew 'binutils'
# brew 'diffutils'
# brew 'gnutls'
# brew 'gnu-indent'
# brew 'gnu-sed'
# brew 'gnu-tar'
# brew 'gnu-which'
# brew 'grep'
# brew 'gawk'
# brew 'ed'
# brew 'watch'
# brew 'wget'
# brew 'rsync'
# brew 'less'
# brew 'gpg2'
# brew 'gzip'
# brew 'libpng'
# brew 'readline'
# brew 'make'
# brew 'lsof'
# brew 'openssh'
# brew 'tcpdump'
# brew 'whois'
# brew 'tig'
# brew 'webkit2png'
# brew 'ack'
# brew 'exiv2'
# brew 'gdal'
# brew 'pigz'
# brew 'python3'
# brew 'ykpers'
# brew 'gmp'
# brew 'lua'
# brew 'lynx'
# brew 'p7zip'
# brew 'pv'
# brew 'rename'
# brew 'rlwrap'
# brew 'vbindiff'
# brew 'zopfli'
# brew 'composer'
# brew 'yarn'

## CTF tools; see https://github.com/ctfs/write-ups
## https://ctftime.org/ctf-wtf/
# brew 'aircrack-ng'
# brew 'bfg'
# brew 'binwalk'
# brew 'cifer'
# brew 'dex2jar'
# brew 'dns2tcp'
# brew 'fcrackzip'
# brew 'foremost'
# brew 'hashpump'
# brew 'hydra'
# brew 'john'
# brew 'knock'
# brew 'netpbm'
# brew 'nmap'
# brew 'pngcheck'
# brew 'socat'
# brew 'sqlmap'
# brew 'tcpflow'
# brew 'tcpreplay'
# brew 'tcptrace'
# brew 'ucspi-tcp' # `tcpserver` etc.
# brew 'xpdf'
# brew 'xz'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

## Apps
# cask '1password'
# cask '1password-cli'
# cask 'aerial'
# cask 'alfred'
# cask 'caffeine'
# cask 'dbngin'
# cask 'discord'
# cask 'docker'
# cask 'figma'
# cask 'firefox'
# cask 'github'
# cask 'gpg-suite'
# cask 'imageoptim'
# cask 'insomnia'
# cask 'screenflow'
# cask 'slack'
# cask 'steam'
# cask 'tableplus'
# cask 'telegram-desktop'
# cask 'the-unarchiver'
# cask 'tinkerwell'
# cask 'transmission'
# cask 'transmit'
# cask 'visual-studio-code'
# cask 'vlc'
# cask 'whatsapp'

# Quicklook
# cask 'qlcolorcode'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'quicklook-csv'
# cask 'qlstephen'

# Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Spark', id: 1176895641
# mas 'Speedtest', id: 1153157709
